tutorials/silencer/silencer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        nFaces          3200;
        startFace       376000;
    }
    inlet
    {
        type            wall;
        nFaces          1600;
        startFace       379200;
    }
    outlet
    {
        type            wall;
        nFaces          1600;
        startFace       380800;
    }
    bottom
    {
        type            wall;
        nFaces          3200;
        startFace       382400;
    }
    back
    {
        type            wall;
        nFaces          3200;
        startFace       385600;
    }
    front
    {
        type            wall;
        nFaces          3200;
        startFace       388800;
    }
)

// ************************************************************************* //
